/**
 * Напишите функцию get1DArray(arr),
 * на вход подается массив бесконечной вложенности массивов arr
 * необходимо вернуть одномерный массив
 * Примеры:
 * [1, 2, 'aa', [1, 2, 3],
    [
        [1, 2],
        [1, 2]
    ],
    [
        [
            [1, 2, [1, 2, [2]]], 3
        ], 4
    ]
]; ---> [1, 2, "aa", 1, 2, 3, 1, 2, 1, 2, 1, 2, 1, 2, 2, 3, 4]
*/

function get1DArray(arr) {
    for (i = 0; i < arr.length; i++) Array.isArray(arr[i]) && arr.splice(i, 1, ...get1DArray(arr[i]))
    return arr;
}


//console.log(get1DArray([
//    1,
//    2,
//    "aa",
//    [1, 2, 3],
//    [
//        [1, 2],
//        [1, 2, []],
//    ],
//    [[[1, 2, [1, 2, [2]]], 3], 4],
//]))
module.exports = get1DArray;
